BUTTONS_MAIN = {
    "main_types": "Види масажу",
    "main_order": "Замовити масаж",
    # "main_helper": "Допомога у виборі масажу",
    "main_price": "Ціна на послуги",
    "main_certificate": "Подарункові сертифікати",
    "main_location": "Де ми працюємо",
    "main_info": "Питання та відповіді",
    # "main_info": "Інформація про Home.Masssage",
}

MODE_MAPPING = {
    # "main_helper": "helper",
    # "main_helper_2": "helper_2",
    "main_price": "price",
    "main_location": "location",
    "main_info": "info",
    "main_order": "order",
    "main_types": "massage",
    "main_certificate": "certificate",
}

BUTTONS_MENU = {
    "start": "головне меню бота",
    "order": "Замовити масаж",
    # "helper": "Допомога у виборі масажу",
    # "price": "Ціна на послуги",
    # "location": "Де ми працюємо",
    "info": "Питання та відповіді",
    "gpt": "задати питання чату GPT 🧠",
}

# BUTTONS_MASSAGE = {
#     "massage_1": "Масаж загальний",
#     "massage_2": "Масаж спини",
#     "massage_3": "Масаж ног",
#     "massage_4": "Масаж офісний",
#     "massage_5": "Масаж антицелюлітний",
#     "massage_6": "Масаж тайський",
#     "massage_certificate": "Подарунковий сертифікат",
#     "massage_custom": "Свій варіант 🙌",
# }


BUTTONS_HELPER = {
    # "helper_1": "Є направлення від лікаря?",
    "helper_2": "Болить спина?",
    "helper_3": "Хронічні болі в спині, руках, ногах?",
    "helper_4": "Поліпшити загальне самопочуття?",
    "helper_5": "Стати гнучкішим, енергійнішим, прибрати блоки тіла?",
    "helper_6": "Не подобається відображення у дзеркалі?",
    "helper_7": "Дістали всі навколо і хочеться забутися на певний час?",
    "helper_8": "В пошуку екзотики?",
    "helper_9": "Купити щастя за гроші?",
    "helper_10": "Готуєте захід для співробітників чи друзів?",
    "helper_11": "Терміново потрібен корисний подарунок?",
}


BUTTONS_HELPER_2 = {
    "Є направлення від лікаря?": [
        "service_noname",
    ],
    "Болить спина?": [
        "service_back",
        "service_back",
        "service_sabai",
    ],
    "Хронічні болі в спині, руках, ногах?": [
        "service_full",
    ],
    "Поліпшити загальне самопочуття?": [
        "service_full",
        "service_sport",
        "service_thai",
        "service_sabai",
    ],
    "Стати гнучкішим, енергійнішим, прибрати блоки тіла?": [
        "service_full",
        "service_sport",
        "service_thai",
        "service_sabai",
    ],
    "Не подобається відображення у дзеркалі?": [
        "service_cellulite",
        "service_face",
    ],
    "Дістали всі навколо і хочеться забутися на певний час?": [
        "service_lomi",
    ],
    "В пошуку екзотики?": [
        "service_thai",
        "service_lomi",
        "service_toksen",
    ],
    "Купити щастя за гроші?": [
        "service_lomi",
    ],
    "Готуєте захід для співробітників чи друзів?": [
        "service_office",
    ],
    "Терміново потрібен корисний подарунок?": [
        "service_certificate",
    ],
}

BUTTONS_SERVICE = {
    "service_full": "Загальний масаж",
    "service_back": "Масаж спини",
    "service_sport": "Спортивний масаж",
    "service_cellulite": "Антицелюлітний масаж",
    "service_office": "Офісний масаж",
    "service_thai": "Тайський масаж",
    "service_toksen": "Масаж Ток-Сен",
    "service_sabai": "Масаж Сабай",
    # "service_bamboo": "Масаж Бамбуком",
    "service_lomi": "Масаж Ломі-Ломі",
    "service_face": "Масаж обличчя",
    "service_certificate": "Подарунковий сертифікат",
    "service_noname": "Ще не визначено 🙌",
}

BUTTON_CERTIFICATE = {
    "order_certificate": "Замовити сертифікат",
    # "faq_certificate": "Питання та відповіді про сертифікат",
}

BUTTONS_ORDER_SERVICE = {
    "choice_service": "Замовити",
    "choice_go_back": "Повернутися до вибору",
}


FAQ = {
    "Що таке `Home.Masssage`?": "`Home.Masssage` - компанія, що надає послуги масажу там, де зручно замовникові (вдома, в готелі, в офісі тощо)",
    "Де працює `Home.Masssage`?": "`Home.Masssage` надає послуги масажу в Києві та Київській області. Ми обслуговуємо Київ та його околиці. Ви можете дізнатися про місця, які ми обслуговуємо, <a href='https://home.masssage.kyiv.ua/therapist/cities/index.php?lang=ua'>тут</a>.",
    "Як мені замовити масаж?": "Це швидко і просто: \n1) Виберіть вид масажу в розділі 'https://home.masssage.kyiv.ua/services/category.php?lang=ua', залежно від Ваших побажань. \n2) Замовте сеанс масажу телефоном, за номером +38 (093) 390-33-57 або заповніть онлайн-форму  на сторінці 'http://home.masssage.kyiv.ua/contact-us/book-online/index.php?lang=ua' \nПримітка:  Призначення вважається остаточним тільки після підтвердження телефоном (подзвоніть нам, щоб замовити сеанс, або ж ми передзвонимо Вам після замовлення через онлайн-форму)",
    "Де проходить сеанс масажу?": "Місце проведення сеансу вибираєте Ви: масаж можна проводити в Вашій оселі, в готелі, в офісі або будь-якому іншому зручному для Вас місці. \nМасаж виконується на зручному масажному столі, з яким до Вас приходить наш масажист. Він також потурбується про масажне масло та інші матеріали. \nХочемо підкреслити, що наша компанія надає виключно професійні послуги масажу, як зазначено в розділі 'http://home.masssage.kyiv.ua/services/index.php?lang=ua'",
    "Коли масажисти `Home.Masssage` надають послуги масажу?": "Масажисти компанії `Home.Masssage` надають послуги масажу щодня, з 08:00 до 23:00.",
    "Коли приїде масажист?": "У будь-який час згідно з Вашим запитом, якщо потрібний Вам масажист на цей момент вільний.\nНеобхідно робити замовлення  мінімум за дві години до початку сеансу масажу, з очевидних причин. А ще краще замовляти сеанс масажу напередодні.",
    "Скільки коштують масажні послуги, які Ви надаєте?": "Ціна на всі види масажу `Home.Masssage` складає 1200 грн за годину\nДетальну інформацію про ціну та особливі умови надано в розділі 'http://home.masssage.kyiv.ua/prices/index.php?lang=ua',",
    "Як можна оплатити масаж?": "  Оплату сеансу можна здійснити двома способами:\n1) Готівкою масажистові, після закінчення сеансу.\n2) Переказом на банківську картку.",
    "Я можу подарувати масаж?": "Звичайно! Ви завжди можете швидко замовити подарунковий сертифікат у розділі 'http://home.masssage.kyiv.ua/certificate/index.php?lang=ua' на сайті.",
    "Що робити після того, як я забронював масаж?": "Все, що Вам варто зробити, - розслабитися і отримувати задоволення від наших послуг.\nМасаж - це блаженство, тому найкращий спосіб відчути його повною мірою - увійти в правильний стан духу: бути розслабленим і щасливим.\nТакож радимо прийняти душ перед приходом масажиста.\n\tВам необхідно повідомити масажисту про будь-які можливі проблеми зі здоров'ям та недавні травми, а також про алергію, що може виникнути через олію для тіла (втім, наші масажисти застосовують гіпоалергенну олію).\n\tПід час сеансу Ви можете розповісти масажисту про своє самопочуття або попросити про якісь зміни в процедурі.",
    "Чи потрібен масаж здоровій людині?": "Однозначно потрібен. По-перше, ідеально здорових людей в природі не існує. По-друге, хворобу легше попередити, ніж перемогти. Саме тому масаж потрібен всім, оскільки він, як мінімум, підвищує ваш особистий імунітет (і життєвий тонус). Імуномодулятори, рекомендовані лікарями, мають загальний вплив, а масаж, як засіб індивідуального впливу, підвищує саме ваш імунітет.",
    "Які види масажу Ви пропонуєте здоровим людям?": "Відносно здоровим людям, при відсутності протипоказань, можна замовлюяти будь-які масажі із списку 'http://home.masssage.kyiv.ua/services/category.php?lang=ua'\nНа початок ми пропонуємо 'http://home.masssage.kyiv.ua/services/item.php?idService=13&lang=ua', 'http://home.masssage.kyiv.ua/services/item.php?idService=22&lang=ua', 'http://home.masssage.kyiv.ua/services/item.php?idService=1&lang=ua', 'http://home.masssage.kyiv.ua/services/item.php?idService=17&lang=ua' массажі. Бажана періодичність - не рідше одного курсу на рік, а краще - два курси на рік. Це дозволить вам уникати застуди, ГРВІ, бути в тонусі, добре спати тощо.",
    "Коли стануть помітні результати масажу?": "Відчутні результати Ви помітите після декількох сеансів масажу. У деяких випадках Ви  матимете результат відразу після першого сеансу. Ви відчуєте тепло, розслаблення, зменшення або повне  зникнення болю, зникнення набряклості, поліпшення сну, підвищення настрою тощо.",
    "Скільки триває сеанс масажу?": "Зазвичай сеанс масажу триває 60-90 хвилин. За 60 хвилин можна обробити якусь одну зону: спина+шия, ноги. За 90 хвилин масажист встигне обробити усе тіло. За дві години можна зробити загальний масаж із глибокою обробкою м'язових груп. За Вашим бажанням масаж може тривати й довше.",
    "Скільки сеансів масажу необхідно зробити?": "Кількість сеансів масажу та періодичність їх проведення залежить від Ваших цілей, стану здоров'я, віку, способу життя тощо. \nЯкщо Ви хочете отримати швидкий результат, рекомендується робити інтенсивний курс масажу: 10 сеансів через день-два. \nСередній курс становить 15-20 сеансів. \nЯкщо Ви робите масаж курсами, то повторювати їх бажано один-два рази на рік. \nЯкщо Ви хочете робити масаж із профілактичною метою, можна робити масаж 1 раз в тиждень на постійній основі. \nТакож можна замовляти масаж 'на вимогу' - одиничні сеанси після втоми, після стресу, щоб відпочити та розслабитися тощо.",
    "Чи можна їсти перед масажем?": "Бажано робити масаж не раніше, ніж через 1 годину після вживання їжі.",
    "У чому ж користь масажу?": "Масаж має безліч корисних ефектів, серед яких: \n1) Зміцнення імунітету та підвищення життєвого тонусу. \n2) Поліпшення кровообігу та лімфотоку, що сприяє кращому живленню тканин та виведенню токсинів. \n3) Зменшення напруженості м'язів, зняття болю та спазмів. \n4) Покращення гнучкості та рухливості суглобів. \n5) Зниження стресу, тривоги та покращення настрою. \n6) Покращення сну та загального самопочуття.",
    "У чому переваги масажу вдома?": "Виклик масажиста додому - найбільш ефективний і зручний варіант:\n1) Вам не доведеться нікуди йти або їхати на сеанс;\n2) Саме Ви призначаєте зручний для Вас час;\n3) Сеанс проходить у Вас вдома, у звичній для Вас атмосфері, що забезпечує відчуття  додаткового комфорту й захищеності;\n4) Після сеансу Вам не потрібно розтрачувати отриманий приплив бадьорості й позитивних емоцій на  поїздку додому,",
    "Чи можу я залишити відгук про масажиста?": "Безумовно. Ми вдячні нашим клієнтам за кожен відгук.\nУ профілі кожного з наших <a href='https://home.masssage.kyiv.ua/therapist/index.php?lang=ua'>масажистів</a> є розділ 'Відгуки', де Ви можете залишити свій відгук про масажиста.",
}
